
import { declineString } from "./declineString";

describe('declineString', () => {
  test.each`
  length  | expected
  ${0}  | ${'секунд'}
  ${1}  | ${'секунда'}
  ${2}  | ${'секунды'}
  ${3}  | ${'секунды'}
  ${4}  | ${'секунды'}
  ${5}  | ${'секунд'}
  ${6}  | ${'секунд'}
  ${7}  | ${'секунд'}
  ${8}  | ${'секунд'}
  ${9}  | ${'секунд'}
  ${10} | ${'секунд'}
  ${11} | ${'секунд'}
  ${12} | ${'секунд'}
  ${13} | ${'секунд'}
  ${14} | ${'секунд'}
  ${15} | ${'секунд'}
  ${16} | ${'секунд'}
  ${17} | ${'секунд'}
  ${18} | ${'секунд'}
  ${19} | ${'секунд'}
  ${20} | ${'секунд'}
  ${21} | ${'секунда'}
  ${22} | ${'секунды'}
  ${23} | ${'секунды'}
  ${24} | ${'секунды'}
  ${25} | ${'секунд'}
  ${26} | ${'секунд'}
  ${27} | ${'секунд'}
  ${28} | ${'секунд'}
  ${29} | ${'секунд'}
  ${30} | ${'секунд'}
  ${31} | ${'секунда'}

  ${100} | ${'секунд'}
  ${101} | ${'секунда'}
  ${102} | ${'секунды'}
  ${103} | ${'секунды'}
  ${104} | ${'секунды'}
  ${105} | ${'секунд'}
  ${106} | ${'секунд'}
  ${107} | ${'секунд'}
  ${108} | ${'секунд'}
  ${109} | ${'секунд'}
  ${110} | ${'секунд'}
  ${111} | ${'секунд'}
  ${112} | ${'секунд'}
  ${113} | ${'секунд'}
  ${114} | ${'секунд'}
  ${115} | ${'секунд'}
  ${116} | ${'секунд'}
  ${117} | ${'секунд'}
  ${118} | ${'секунд'}
  ${119} | ${'секунд'}
  ${120} | ${'секунд'}
  ${121} | ${'секунда'}
  ${122} | ${'секунды'}
  ${123} | ${'секунды'}
  ${124} | ${'секунды'}
  ${125} | ${'секунд'}
  ${126} | ${'секунд'}
  ${127} | ${'секунд'}
  ${128} | ${'секунд'}
  ${129} | ${'секунд'}
  ${130} | ${'секунд'}
  ${131} | ${'секунда'}
  `('length === $length', ({ length, expected }) => {
    expect(declineString({
      length,
      1: 'секунда',
      2: 'секунды',
      5: 'секунд',
    })).toBe(expected)
  });
});
